# Leitura e Visualização dos Datasets

Este notebook realiza a leitura de todos os datasets gerados e exibe informações sobre cada um.

In [4]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp310-cp310-macosx_11_0_arm64.whl.metadata (91 kB)
Collecting numpy>=1.22.4 (from pandas)
  Downloading numpy-2.2.6-cp310-cp310-macosx_14_0_arm64.whl.metadata (62 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/cassiopinheiro/Library/Python/3.10/lib/python/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Users/cassiopinheiro/Library/Python/3.10/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp310-cp310-macosx_11_0_arm64.whl (10.8 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.8/10.8 MB 1.7 MB/s eta 0:00:00a 0:00:01
Downloading numpy-2.2.6-cp310-cp310-macosx_14_0_arm64.whl (5.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 5.3/5.3 MB 1.7 MB/s eta 0:00:0000:0100:01
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 4/4 [pandas]2m3/4 [pandas]
Successfully installed numpy-2.2.6 pandas-2.3.3 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: /opt/homebrew/opt/python@3.10/bin/python3.10 -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as pd
import os

# Definir o diretório dos datasets
datasets_dir = os.path.join(os.getcwd(), 'datasets')

## 1. Dataset Titanic

In [7]:
# Carregar dataset Titanic
titanic_df = pd.read_csv(os.path.join(datasets_dir, 'titanic.csv'))

print("=" * 60)
print("DATASET TITANIC")
print("=" * 60)
print(f"\nDimensões: {titanic_df.shape[0]} linhas x {titanic_df.shape[1]} colunas\n")

print("Primeiras 10 linhas:")
display(titanic_df.head(10))

print("\nInformações do dataset:")
titanic_df.info()

print("\nEstatísticas descritivas:")
display(titanic_df.describe())

============================================================
DATASET TITANIC
============================================================

Dimensões: 500 linhas x 6 colunas

Primeiras 10 linhas:

   PassengerId  Pclass     Sex        Age        Fare  Survived
0            1       2  female   9.299793   96.400298         0
1            2       3    male  46.012557  108.948810         1
2            3       3    male  34.738950   33.385867         0
3            4       3    male  24.185969   33.466690         0
4            5       1    male  38.858946   15.134000         1
5            6       1    male  61.789700  113.096282         0
6            7       1  female  32.546128  102.932634         1
7            8       3    male  33.475088   76.448323         0
8            9       3  female  23.568947  128.183863         1
9           10       3  female  18.102179  122.793821         0

Informações do dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  500 non-null    int64
 1   Pclass       500 non-null    int64
 2   Sex          500 non-null    object
 3   Age          500 non-null    float64
 4   Fare         500 non-null    float64
 5   Survived     500 non-null    int64
dtypes: float64(2), int64(3), object(1)
memory usage: 23.6+ KB

Estatísticas descritivas:

       PassengerId      Pclass         Age        Fare    Survived
count   500.000000  500.000000  500.000000  500.000000  500.000000
mean    250.500000    2.290000   31.160351   80.418234    0.398000
std     144.481833    0.814387   13.567708   40.607101    0.489976
min       1.000000    1.000000    1.000000   10.691597    0.000000
25%     125.750000    2.000000   22.211264   43.427956    0.000000
50%     250.500000    3.000000   31.050979   82.622747    0.000000
75%     375.250000    3.000000   39.830386  113.284100    1.000000
max     500.000000    3.000000   66.853349  149.917922    1.000000

## 2. Dataset Vendas

In [ ]:
# Carregar dataset Vendas
vendas_df = pd.read_csv(os.path.join(datasets_dir, 'vendas.csv'))

print("=" * 60)
print("DATASET VENDAS")
print("=" * 60)
print(f"\nDimensões: {vendas_df.shape[0]} linhas x {vendas_df.shape[1]} colunas\n")

print("Primeiras 10 linhas:")
display(vendas_df.head(10))

print("\nInformações do dataset:")
vendas_df.info()

print("\nEstatísticas descritivas:")
display(vendas_df.describe())

       Qtd_Vendida        Receita          Custo          Lucro
count   900.000000     900.000000     900.000000     900.000000
mean     51.438889  141452.114244   91986.258744   49465.855500
std      27.235953  108134.819145   72201.048625   40695.958985
min       5.000000    3284.880000    2030.800000    1254.080000
25%      27.000000   55459.507500   35107.907500   18567.542500
50%      52.000000  110074.785000   68559.665000   37635.710000
75%      75.000000  207464.217500  133245.222500   71310.417500
max      99.000000  489841.550000  388534.470000  217130.040000

## 3. Dataset IBGE População

In [10]:
# Carregar dataset IBGE População
ibge_df = pd.read_csv(os.path.join(datasets_dir, 'ibge_populacao.csv'))

print("=" * 60)
print("DATASET IBGE POPULAÇÃO")
print("=" * 60)
print(f"\nDimensões: {ibge_df.shape[0]} linhas x {ibge_df.shape[1]} colunas\n")

print("Primeiras 10 linhas:")
display(ibge_df.head(10))

print("\nInformações do dataset:")
ibge_df.info()

print("\nEstatísticas descritivas:")
display(ibge_df.describe())

============================================================
DATASET IBGE POPULAÇÃO
============================================================

Dimensões: 50 linhas x 3 colunas

Primeiras 10 linhas:

    Ano        Regiao  Populacao
0  2015         Norte   21509733
1  2015      Nordeste   21068282
2  2015  Centro-Oeste   17554494
3  2015       Sudeste   14273480
4  2015           Sul    8764461
5  2016         Norte   25896766
6  2016      Nordeste   26113778
7  2016  Centro-Oeste   22531170
8  2016       Sudeste   15930513
9  2016           Sul   24382404

Informações do dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Ano        50 non-null     int64
 1   Regiao     50 non-null     object
 2   Populacao  50 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.3+ KB

Estatísticas descritivas:

               Ano     Populacao
count    50.000000  5.000000e+01
mean   2019.500000  1.697086e+07
std       2.901442  8.448440e+06
min    2015.000000  1.158998e+06
25%    2017.000000  1.027487e+07
50%    2019.500000  1.851563e+07
75%    2022.000000  2.402368e+07
max    2024.000000  2.953902e+07

## 4. Dataset COVID

In [12]:
# Carregar dataset COVID
covid_df = pd.read_csv(os.path.join(datasets_dir, 'covid.csv'))

print("=" * 60)
print("DATASET COVID")
print("=" * 60)
print(f"\nDimensões: {covid_df.shape[0]} linhas x {covid_df.shape[1]} colunas\n")

print("Primeiras 10 linhas:")
display(covid_df.head(10))

print("\nInformações do dataset:")
covid_df.info()

print("\nEstatísticas descritivas:")
display(covid_df.describe())

============================================================
DATASET COVID
============================================================

Dimensões: 740 linhas x 5 colunas

Primeiras 10 linhas:

         Data        Regiao  Casos  Obitos  Vacinados
0  2020-03-01         Norte   4781     206       1945
1  2020-03-01      Nordeste   2164      67        758
2  2020-03-01  Centro-Oeste    417       8        334
3  2020-03-01       Sudeste   2142     102        546
4  2020-03-01           Sul    809      37        205
5  2020-03-08         Norte   4509     178       1318
6  2020-03-08      Nordeste   2703      14       1641
7  2020-03-08  Centro-Oeste   4521     177       2343
8  2020-03-08       Sudeste   2361      85        545
9  2020-03-08           Sul   3734      66       1254

Informações do dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 740 entries, 0 to 739
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Data       740 non-null    object
 1   Regiao     740 non-null    object
 2   Casos      740 non-null    int64
 3   Obitos     740 non-null    int64
 4   Vacinados  740 non-null    int64
dtypes: int64(3), object(2)
memory usage: 29.0+ KB

Estatísticas descritivas:

             Casos      Obitos    Vacinados
count   740.000000  740.000000   740.000000
mean   2552.208108   61.027027  1446.347297
std    1439.869891   54.935827   999.974083
min     109.000000    0.000000    30.000000
25%    1304.500000   18.000000   671.000000
50%    2506.000000   43.000000  1236.500000
75%    3818.000000   90.250000  2112.500000
max    4997.000000  242.000000  4276.000000

## 5. Dataset Filmes

In [13]:
# Carregar dataset Filmes
filmes_df = pd.read_csv(os.path.join(datasets_dir, 'filmes.csv'))

print("=" * 60)
print("DATASET FILMES")
print("=" * 60)
print(f"\nDimensões: {filmes_df.shape[0]} linhas x {filmes_df.shape[1]} colunas\n")

print("Primeiras 10 linhas:")
display(filmes_df.head(10))

print("\nInformações do dataset:")
filmes_df.info()

print("\nEstatísticas descritivas:")
display(filmes_df.describe())

============================================================
DATASET FILMES
============================================================

Dimensões: 200 linhas x 5 colunas

Primeiras 10 linhas:

      Filme   Genero   Ano  Nota  Popularidade
0   Filme_1   Terror  2004   1.9          9323
1   Filme_2     Ação  1997   9.8          8499
2   Filme_3   Terror  2008   3.6          2037
3   Filme_4   Ficção  2015   4.8          1246
4   Filme_5     Ação  1999   6.8          5252
5   Filme_6    Drama  2003   1.2          4399
6   Filme_7     Ação  2008   8.3          8218
7   Filme_8  Comédia  2019   5.8          8734
8   Filme_9     Ação  1994   3.5          7859
9  Filme_10    Drama  2020   1.6          8053

Informações do dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Filme         200 non-null    object
 1   Genero        200 non-null    object
 2   Ano           200 non-null    int64
 3   Nota          200 non-null    float64
 4   Popularidade  200 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 7.9+ KB

Estatísticas descritivas:

               Ano        Nota  Popularidade
count   200.000000  200.000000    200.000000
mean   2006.415000    5.241000   4985.720000
std       9.562951    2.454515   2745.442003
min    1990.000000    1.000000    253.000000
25%    1999.000000    3.200000   2641.000000
50%    2006.000000    5.150000   4883.000000
75%    2015.000000    7.025000   7295.250000
max    2023.000000   10.000000   9881.000000

## Resumo Geral dos Datasets

In [14]:
# Criar um resumo de todos os datasets
resumo = pd.DataFrame({
    'Dataset': ['Titanic', 'Vendas', 'IBGE População', 'COVID', 'Filmes'],
    'Linhas': [
        titanic_df.shape[0],
        vendas_df.shape[0],
        ibge_df.shape[0],
        covid_df.shape[0],
        filmes_df.shape[0]
    ],
    'Colunas': [
        titanic_df.shape[1],
        vendas_df.shape[1],
        ibge_df.shape[1],
        covid_df.shape[1],
        filmes_df.shape[1]
    ]
})

print("\n" + "=" * 60)
print("RESUMO GERAL DOS DATASETS")
print("=" * 60 + "\n")
display(resumo)

============================================================
RESUMO GERAL DOS DATASETS
============================================================

          Dataset  Linhas  Colunas
0         Titanic     500        6
1          Vendas     900        8
2  IBGE População      50        3
3           COVID     740        5
4          Filmes     200        5

Daqui pra frente é nossa tarefa de casa.....